tutorials/laminar/2DCollapse/loose/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
            alpha
            {
            field alpha_a; //field to initialise
            fields
            (
            z alpha
            );
            lookuptables (
            {
            name inletprofilealpha;
            outOfBounds clamp;
            file "$FOAM_CASE/initial_1D_profile/alpha_0_1d";
            }
            );
            expression "inletprofilealpha(pos().z)";
            condition "pos().x <= 0.06  ";
            keepPatches 1;
	}

            pff
            {
            field pff; //field to initialise
            fields
            (
            z pff
            );
            lookuptables 
            (
            {
            name inletprofilealpha;
            outOfBounds clamp;
            file "$FOAM_CASE/initial_1D_profile/pff_0_1d";
            }
            );
            expression "inletprofilealpha(pos().z)";
            condition "pos().x <= 0.06  ";
            keepPatches 1;
        }
 );

// ************************************************************************* //
