tutorials/laminar/2DCollapse/loose/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rbgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.0000;
    }

    p_rbghFinal
    {
        $p_rbgh;
        tolerance       1e-9;
        relTol          0;
    }

    "(k|epsilon|omega|pa|alphaPlastic)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.00;
    }

    "(kFinal|epsilonFinal|omegaFinal|paFinal|alphaPlasticFinal)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0;
    }

    alpha.a
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
    }
    alpha.aFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
}


relaxationFactors
{
    fields
    {
        pa              1.;
        p_rbgh               0.9;

    }
}

PIMPLE
{
    momentumPredictor 0;
    nOuterCorrectors  2;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    correctAlpha    1;
    nAlphaCorr      1;
    pRefCell        0;
    pRefValue       0;
}
    

// ************************************************************************* //
