tutorials/laminar/2DCollapse/loose/system/probe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


functions
{
probes
{
// Where to load it from
libs ( "libsampling.so" );

type        probes;

// Name of the directory for probe data
name        probes;
writeInterval   1;
// Fields to be probed
fields (
        p_rbgh
        p
    //    Ua
      //  Ub
       );

probeLocations // Locations to be probed. runTime modifiable!
       (
        (0.02 0.00001 0.0)
        (0.03 0.00001 0.0)

       );
}

} 
 
